#### Terraform Plan
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.ct_config.ignition will be read during apply
  # (config refers to values not yet known)
 <= data "ct_config" "ignition" {
      + content      = (known after apply)
      + files_dir    = "./.."
      + id           = (known after apply)
      + pretty_print = false
      + rendered     = (known after apply)
      + strict       = true
    }

  # null_resource.regenerate_key must be replaced
-/+ resource "null_resource" "regenerate_key" {
      ~ id       = "8137926806526729269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "bootstrap_config_hash" = "785eec1e51823a3ea27802ba01a98fa4711d8f5096c99f41eab611c2c91d04a3" -> "426a12e380cba8b853aa291bd2c2347c1ea549fd4e244e7ad846b54f447fd753"
          ~ "ignition_config_hash"  = "9d61c8f1387ba8eea8c7611dc44f85c7035b55744ba624ba019a76d12e8c308d" -> "fb5989901e8f07021ca670d32521f7d9f590cfa3b09b4a98ab6a3ec70a73cd54"
            # (10 unchanged elements hidden)
        }
    }

  # oci_core_instance.this must be replaced
-/+ resource "oci_core_instance" "this" {
      ~ boot_volume_id                      = "ocid1.bootvolume.oc1.uk-london-1.abwgiljtbgole3bf6bboezo63dsg6ol5mopyq2ir35mgs5gbli5sgn7gc54q" -> (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      ~ defined_tags                        = {
          - "Oracle-Tags.CreatedBy" = "default/terraform" -> null
          - "Oracle-Tags.CreatedOn" = "2026-02-01T23:06:53.678Z" -> null
            # (3 unchanged elements hidden)
        }
      ~ extended_metadata                   = {} -> (known after apply)
      ~ fault_domain                        = "FAULT-DOMAIN-3" -> (known after apply)
      ~ freeform_tags                       = {} -> (known after apply)
      + hostname_label                      = (known after apply)
      ~ id                                  = "ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acjmxpk5llgfyzwybzwopnuixwsci2ifwg2lx4kcfpu25a" -> (known after apply)
      ~ image                               = "ocid1.image.oc1.uk-london-1.aaaaaaaaze7uoavoo7lblhkq4rzfclpwrrfoubqvqiprstvqtpvi4j4ymfka" -> (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_ai_enterprise_enabled            = (known after apply)
      ~ is_cross_numa_node                  = false -> (known after apply)
      ~ launch_mode                         = "PARAVIRTUALIZED" -> (known after apply)
      ~ metadata                            = {
          - "user_data" = "eyJpZ25pdGlvbiI6eyJjb25maWciOnsicmVwbGFjZSI6eyJ2ZXJpZmljYXRpb24iOnt9fX0sInByb3h5Ijp7fSwic2VjdXJpdHkiOnsidGxzIjp7fX0sInRpbWVvdXRzIjp7fSwidmVyc2lvbiI6IjMuNC4wIn0sImtlcm5lbEFyZ3VtZW50cyI6e30sInBhc3N3ZCI6e30sInN0b3JhZ2UiOnsiZGlyZWN0b3JpZXMiOlt7Imdyb3VwIjp7fSwicGF0aCI6Ii9vcHQvZGF0YSIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9yZXBvIiwidXNlciI6e30sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2VudiIsInVzZXIiOnt9LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzIiwidXNlciI6e30sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvZXRjL29jaS12YXVsdCIsInVzZXIiOnt9LCJtb2RlIjo0NDh9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy9yY2xvbmUiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvYnVja2V0IiwidXNlciI6e30sIm1vZGUiOjQ0OH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NlY3JldHMiLCJ1c2VyIjp7fSwibW9kZSI6NDQ4fV0sImZpbGVzIjpbeyJncm91cCI6e30sInBhdGgiOiIvZXRjL3RtcGZpbGVzLmQvb2NpLWFwcHMuY29uZiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LGQlMjAlMkZydW4lMkZzZWNyZXRzJTIwMDc1NSUyMHJvb3QlMjByb290JTIwLSUwQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0MjB9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL2V0Yy96aW5jYXRpL2NvbmZpZy5kLzU1LXVwZGF0ZS1zdHJhdGVneS50b21sIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTo7YmFzZTY0LFczVndaR0YwWlhOZENuTjBjbUYwWldkNUlEMGdJbkJsY21sdlpHbGpJZ29LVzF0MWNHUmhkR1Z6TG5CbGNtbHZaR2xqTG5kcGJtUnZkMTFkQ21SaGVYTWdQU0JiSUNKVGRXNGlJRjBLYzNSaGNuUmZkR2x0WlNBOUlDSXdNem93TUNJS2JHVnVaM1JvWDIxcGJuVjBaWE1nUFNBeE1qQUsiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6NDIwfSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvb2NpLXZhdWx0L2NvbmZpZyIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzV6UHUyNnNNQmdFNEg3ZlpaRTQzS3BUckFnRjBpcUpnQ1FsK3JIeHdtTDhZK01iZnZvb1NSbWwyYWxHMDN5YTk4dmJ0ZXZicW15cXJxK2YrdkphVjg5ZjdUK1NtY2FSQmNQMVBoSTE2Z2hKSEpubHpGRlFGT2M0Z2hXKzQvZ1VvQURBa0pHSlNqNTZBOGVOSEVzV0RwcXp3U1NVMFgzTEJSK1VkV1l1VkFhblArQ2Y0UUU4R3pWTHVWYnJQZHo5TUJNWjdDd0tTS1oxMDRqL1RNNlVsK1ltQ3JmS1gzaFR0VjFkOXErWHR2MTRhUjc1bm5MbldJRnEySUdndFg0eGR0aU5UQVJKTjNCZXpjRWpPY0xDZkM1UG53RUFBUC8vN3R6ZTVIVUJBQUE9IiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjM4NH0seyJncm91cCI6e30sInBhdGgiOiIvZXRjL3JjbG9uZS9yY2xvbmUuY29uZiIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LCU1Qm9jaS1iYWNrdXAlNUQlMEF0eXBlJTIwJTNEJTIwb3JhY2xlb2JqZWN0c3RvcmFnZSUwQXByb3ZpZGVyJTIwJTNEJTIwaW5zdGFuY2VfcHJpbmNpcGFsX2F1dGglMEFuYW1lc3BhY2UlMjAlM0QlMjBscmt5MGYxbm1vdHMlMEFyZWdpb24lMjAlM0QlMjB1ay1sb25kb24tMSUwQW5vX2NoZWNrX2J1Y2tldCUyMCUzRCUyMHRydWUlMEEiLCJ2ZXJpZmljYXRpb24iOnt9fSwibW9kZSI6Mzg0fSx7Imdyb3VwIjp7fSwicGF0aCI6Ii9ldGMvYnVja2V0L2NvbmZpZyIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6IiIsInNvdXJjZSI6ImRhdGE6LEJVQ0tFVF9OQU1FJTNEb2NpLWFwcHMlMEFPQ0lfTkFNRVNQQUNFJTNEbHJreTBmMW5tb3RzJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjM4NH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L3NjcmlwdHMvZmlyc3QtYm9vdC5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzN5UndXb2JRUXlHNy9zVXF0dFRZWFlQS1EwVVNnL3V4UkFJTkwyRllNYXoydDBoTXlOVjBycHh5TU9YM2NSMldFeHZnL1RQSi9IcDQ0ZG1GMHV6OHpwVWlnWU9Sd0tPakoyUHFhb3dEQVNybi9TM0pQSnRMRDM4OWpGcDhBbnJ1bDVWWVpRRXJ0TzdHeGpNV0w4MURULzJXdHNwRlNnM2FuNlhzRGtWdDhrYnFtMjk1SzlmYXV1ZndSRTBsdmtjbWFxVmVRSDM5TnhkNklGYno5VXE4S0s3L1h4Ky82ZlZRak9xTkltQ1Q3T0NTakk0dVRoclNYblRjbElCc2FqNU5FR05sdHpWMGVMbU5UUko1SU1OVks0Y1I1NDFDbWRIYW9JbkZEam5tZFBCcGJqSDkva0x0TnYxQnRZM0cvQ2xCYVkyKytJQ1pTWjl2UkZIdm5xSFpjRXVQbjAvYndrVW9nc3BMdjRlQjYwSERJL1RtSTRFYnU5ZzVIYTYzbkx2a1h2eExjTExDOXpmdzZjZjRQQVBYRi9EdzhNUjlBc3o3U2NRTVJiVndTbktIbVVKb2oyS3hCWkJwand1MG1mWWpzZ21taEhNcGlBTXZ2UnZpK2xCRFhPd0JESUhxMzhCQUFELy94Q2MzNXZvQWdBQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzL2ZldGNoLWNvbmZpZy5zaCIsInVzZXIiOnt9LCJjb250ZW50cyI6eyJjb21wcmVzc2lvbiI6Imd6aXAiLCJzb3VyY2UiOiJkYXRhOjtiYXNlNjQsSDRzSUFBQUFBQUFDLzRSVjMyL2JOaEIrNTE5eDQvUVFyNU9WWkcvdHRNRk5NcXhZMGdacEFtellCb09pVHRiTkZNbVNwN2xaMGY5OTBDOWJMbExreWVMZGQ1OCszbjA2Zi90TlZwRE5DaFZyRVpFaHhkYUJKNCtWSWlQRXplcjM5ZXIrL3VybTl2NTlmbjRxTHErdVYzL2tQNXlLMXc4WHYxM2RyOSt1YnE1eW1aekplZUQ5N2VxaWk1NUwwVld1TDkvYzVUTGp4bWRPVTZxZHJXaVRsbTVualZPbEZIZFh0Ky9XRDNmWHVheVpmWHlaWlJ2aXVpMlcyalZab1pnc2FmVmZYNnU4ajhzTjhWZzBFRHZQV1VEdjlvZ3grL3B1OWZiaTExeFdxTGdObUpFbEptWFNvaVZUU2lFbUJlc2RjYjBPeUlFd25pemdrd0F3VGlzRFBtQkZIL1BrYkI4cE1YS2VuTy9QaWhrYnovbVpFQUROdHFRQXFRZVpkRGdwQUVJRGFhaEFKbE1qNURIdUVCWUF1NW9Nd3NuSnhBby81akFmQUN3V3I2QjBBZ0FBZGUxQXJrWmdNbFpreVJ6L0VpN0hLNUxkUURMY0J0akJLSzhuNm9iK0F2dEhwd2xjQkZmOGc1cWhhTTEyUHlYNHEwY0FwS2xxdVFheWtaWFZ1UGFCckNhdnpBeGhWWVBSSzQwZ2t5OXRJV2U0b3RWYjVCNStqSnlEUnRWeWxEOVBUZUxTcnAyelhzNGc3bDhNdTBBOFhIQ1lXV1RGYmN5VG4vZjNUM0hvQlZYd0p5UkRIbEw4QUtmdzl5dmdHdTFJMkFQU2N2YXliSy9yR0FtZ1BhVGhLZVIzb3o4eU9XSXJHaCtlZEV1ZlFHNkRoVk14d2llMU02Lzg5SVJYWm5vR3YveWl5R0FKcW1JTWNPU1ZpU2RPcjhTUHhIQjI5TUtCWS9JVVZEM1o5NTI0OE5nNWpDd2tuL29OOFRrdWw4dUJLUnBFRDBrZjdnTUh6Uzlld0dJaEFFcG5VWHdXWXRTSXJPdU9ibGdVYlZCTXprSVZYQVB2THQ3QTRKcWUvK2xQR09SUW1YMW9WV21RWXlaQlpzZzYwODZ5SW9zaFp2RXhNamFsZklaaWhPMFpwdlB3KzF3MTJZb2lhV1hHcGRmVEJPYzRXMzZKZUk2S2c4S0t0bDhsR3ZQUDBhaVdYY0RJcEwvS2RJRElhU1FYeHRsdUlzcDdRM3FZUjdkeEk3RUxqLzBvWmp2dHBLUXdmdFBUbHBZTEtUYkVvSTJ6MkgyNTZMbUdzMjRIQkdWMVBVR0hsUzJuNDhQZHRaeXpDR01oamJQSWJLSVMraitDUTBDSVlVaWFEWlFLRzJmVGdGMW41Z20wcWpDZEl1dDIvZHFvQXNZNnhMajBpdXMrNG8yeVczVTRXMkxHY0RnSExBMFZoN1B5UGkyVTNyWit5ZFJnNklNYll1ZGpHaCt0SHFMNzFoNmJ2UE0rYU5kNGc0eFMvQjhBQVAvL2w5QnlRWjRIQUFBPSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzL2ZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvN3lVUVc4YVB4REY3LzRVODEvUVA4bkIwRlpWYzZnYUthSkVRb3FhQ2lnNXBCSHkyclBzaUYxN2E0OUxxZmp3MVdaM2FRbVZjcUluMEhqZTc4MGJXOXY3YjVpU0hhWXE1Q0lnZzhUb29LSUtNMFdGRUQyNFFkWTVCTlFlT1VBTVpGZEFOckN5R3FIeVpEVlZxb0J6NjBCN05HaVpWQkhBSWhvMEYySjBPeGwvbWk4bkh6LzB6NTJtUGFqNWxXbTBwa0JZSWNOWEFTQ2xpcHp2K2N2Zi9PYTBWWkdCcEwrNC9uSTdYODdHbyttNDVpLzNUa25iL0MyaTM4S1pVYXdHeVlHZjFNNHlXazRHN1orelZ1TFZScnJJVldUWVFhb0N2bnNMMGx5SUxrYmo5cStpTklWVHhKbU9aL1BKYVBuNWVqYTd2NXVlL202ZStaMGlVZzhXcWlDakdQYzVOdWdSc3ZyOW9oR1V3Y01EeUorUTlQOTRLYnZkUWFuYmVGYyttdnZ4OFQxd2psWUFBS0RPSFNRM2lnbzB3SzZ4MnJ0bjNwVndONXJBUXNXQ0U3ajYvMDJqK2tFTXIwVkc5Y3ozbmhocmJZbWw4MXVaS3IydVlXV1ZCZGdRUCtHaVI2alFseFFDT2R1U09VY0lyRHlMV0txd2hsZVhsNkpjRy9JZ0t4ajZhSWZ0SU9KcFRHa1BnMThkOUF6SlpoUklxMExxZ3REVzEzaXM2N2J6a3JZNUVBM2dMMHQ4cHZjWW1MU3NWQWdiNTAybm05WGhtcTlOeDFjcnREd1lEQklSdG9HeDFGdzBPd0FwclpOcDRmVDZxRDJnLzA0YWo3QnpyekNqOVVzNGJ0czZ6SzhBQUFELy8yT1dNS0V4QlFBQSIsInZlcmlmaWNhdGlvbiI6e319LCJtb2RlIjo0OTN9LHsiZ3JvdXAiOnt9LCJwYXRoIjoiL29wdC9zY3JpcHRzL2dpdG9wcy1zeW5jLnNoIiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiZ3ppcCIsInNvdXJjZSI6ImRhdGE6O2Jhc2U2NCxINHNJQUFBQUFBQUMvMlRPd1dyRE1Bd0c0THVlUXRWeVdBL0dEekJ5eU5wQUI5MHl3bTVqRENlVkc0R3hoZU1NOXZZbExUMzFMUDNmL3o5dDdDRFJEbTZlWU9hQ2hwZUVLc3JlU1FEbzI4L3VkLy9XMTJTVEZwdFprMDJqR0tjNkU3ejJ6Y2Z1VUpOblY1Yk1WcUlVY2NFTWk0UVRBWXducE9wT0VKeWxvT2N5VHBpeW5DVWlWVGVCQUk3ZHJqblcxZlA2ay9uUHFNc3o0NkZ0OWx2bzIvZnVxMzA0MGsyeGQyUUxJQjYva2FvclJyaXByL1ZybVBEbkJjdkVFUkJYUlpjUTBCanZUWXJoLzNHUEY3Z0VBQUQvLzR5bmVLY2FBUUFBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQ5M30seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9mcmVzaHJzcy5lbnYiLCJ1c2VyIjp7fSwiY29udGVudHMiOnsiY29tcHJlc3Npb24iOiIiLCJzb3VyY2UiOiJkYXRhOixGUkVTSFJTU19IT1NUJTNEcnNzLmRjdS5zaCUwQUZVTExURVhUUlNTX0hPU1QlM0RmdHIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9wbGFua2EuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosUExBTktBX0hPU1QlM0RwbGFua2EuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9uaXR0ZXIuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosTklUVEVSX0hPU1QlM0RuaXR0ZXIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH0seyJncm91cCI6e30sInBhdGgiOiIvb3B0L2Vudi9yZWRsaWIuZW52IiwidXNlciI6e30sImNvbnRlbnRzIjp7ImNvbXByZXNzaW9uIjoiIiwic291cmNlIjoiZGF0YTosUkVETElCX0hPU1QlM0RyZWRsaWIuZGN1LnNoJTBBIiwidmVyaWZpY2F0aW9uIjp7fX0sIm1vZGUiOjQyMH1dfSwic3lzdGVtZCI6eyJ1bml0cyI6W3siZW5hYmxlZCI6dHJ1ZSwibmFtZSI6InBvZG1hbi5zb2NrZXQifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1GaXJzdCBib290IGluaXRpYWxpemF0aW9uICh1cGRhdGVzICsgU1NIIHJlbW92YWwpXG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXRcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuQ29uZGl0aW9uRmlyc3RCb290PXllc1xuXG5bU2VydmljZV1cblR5cGU9b25lc2hvdFxuRXhlY1N0YXJ0PS9vcHQvc2NyaXB0cy9maXJzdC1ib290LnNoXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJmaXJzdC1ib290LnNlcnZpY2UifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1UYWlsc2NhbGUgRGFlbW9uXG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblxuW1NlcnZpY2VdXG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FeGVjU3RhcnQ9L3Vzci9sb2NhbC9iaW4vdGFpbHNjYWxlZCAtLXN0YXRlPS92YXIvbGliL3RhaWxzY2FsZS90YWlsc2NhbGVkLnN0YXRlXG5SZXN0YXJ0PW9uLWZhaWx1cmVcblJlc3RhcnRTZWM9NVxuXG5bSW5zdGFsbF1cbldhbnRlZEJ5PW11bHRpLXVzZXIudGFyZ2V0XG4iLCJlbmFibGVkIjp0cnVlLCJuYW1lIjoidGFpbHNjYWxlZC5zZXJ2aWNlIn0seyJjb250ZW50cyI6IltVbml0XVxuRGVzY3JpcHRpb249QXV0aGVudGljYXRlIFRhaWxzY2FsZSAoaWYgbm90IGFscmVhZHkgYXV0aGVudGljYXRlZClcbkFmdGVyPW5ldHdvcmstb25saW5lLnRhcmdldCB0YWlsc2NhbGVkLnNlcnZpY2VcbldhbnRzPW5ldHdvcmstb25saW5lLnRhcmdldFxuUmVxdWlyZXM9dGFpbHNjYWxlZC5zZXJ2aWNlXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FeGVjU3RhcnQ9L2Jpbi9iYXNoIC1jICdcXFxuICBpZiAvdXNyL2xvY2FsL2Jpbi90YWlsc2NhbGUgc3RhdHVzIC0tanNvbiAyXHUwMDNlL2Rldi9udWxsIHwgZ3JlcCAtcSBcIlxcXCJCYWNrZW5kU3RhdGVcXFwiOlxcXCJSdW5uaW5nXFxcIlwiOyB0aGVuIFxcXG4gICAgZWNobyBcIlRhaWxzY2FsZSBhbHJlYWR5IGF1dGhlbnRpY2F0ZWRcIjsgXFxcbiAgZWxzZSBcXFxuICAgIGVjaG8gXCJBdXRoZW50aWNhdGluZyBUYWlsc2NhbGUuLi5cIjsgXFxcbiAgICAvdXNyL2xvY2FsL2Jpbi90YWlsc2NhbGUgdXAgLS1hdXRoLWtleT1cInRza2V5LWF1dGgta3ZRMzR0UWt3UDExQ05UUkwtZlFLRnV1TGptOEtqMlBUR0FWOWk2S1QycW9IazFiZEVoXCIgLS1zc2ggLS1hY2NlcHQtcm91dGVzOyBcXFxuICBmaSdcblJlbWFpbkFmdGVyRXhpdD15ZXNcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6InRhaWxzY2FsZS1hdXRoLnNlcnZpY2UifSx7ImNvbnRlbnRzIjoiW1VuaXRdXG5EZXNjcmlwdGlvbj1GZXRjaCBjb25maWd1cmF0aW9uIGZyb20gT0NJIGJ1Y2tldFxuQWZ0ZXI9bmV0d29yay1vbmxpbmUudGFyZ2V0IGZpcnN0LWJvb3Quc2VydmljZSB0YWlsc2NhbGUtYXV0aC5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblJlcXVpcmVzPWZpcnN0LWJvb3Quc2VydmljZVxuQmVmb3JlPWZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNlcnZpY2VcbkNvbmRpdGlvblBhdGhFeGlzdHM9IS9ldGMvZmV0Y2gtY29uZmlnLWNvbXBsZXRlXG5cbltTZXJ2aWNlXVxuVHlwZT1vbmVzaG90XG5TdGFuZGFyZE91dHB1dD1qb3VybmFsK2NvbnNvbGVcblN0YW5kYXJkRXJyb3I9am91cm5hbCtjb25zb2xlXG5FbnZpcm9ubWVudEZpbGU9L2V0Yy9idWNrZXQvY29uZmlnXG5FeGVjU3RhcnQ9L29wdC9zY3JpcHRzL2ZldGNoLWNvbmZpZy5zaCAke0JVQ0tFVF9OQU1FfSAke09DSV9OQU1FU1BBQ0V9XG5FeGVjU3RhcnRQb3N0PS91c3IvYmluL3RvdWNoIC9ldGMvZmV0Y2gtY29uZmlnLWNvbXBsZXRlXG5SZW1haW5BZnRlckV4aXQ9eWVzXG5cbltJbnN0YWxsXVxuV2FudGVkQnk9bXVsdGktdXNlci50YXJnZXRcbiIsImVuYWJsZWQiOnRydWUsIm5hbWUiOiJmZXRjaC1jb25maWcuc2VydmljZSJ9LHsiY29udGVudHMiOiJbVW5pdF1cbkRlc2NyaXB0aW9uPUZldGNoIGJvb3RzdHJhcCBzZWNyZXRzIGZyb20gT0NJIFZhdWx0XG5BZnRlcj1uZXR3b3JrLW9ubGluZS50YXJnZXQgZmlyc3QtYm9vdC5zZXJ2aWNlIGZldGNoLWNvbmZpZy5zZXJ2aWNlXG5XYW50cz1uZXR3b3JrLW9ubGluZS50YXJnZXRcblJlcXVpcmVzPWZldGNoLWNvbmZpZy5zZXJ2aWNlXG5CZWZvcmU9aW5maXNpY2FsLWFnZW50LnNlcnZpY2VcblxuW1NlcnZpY2VdXG5UeXBlPW9uZXNob3RcblN0YW5kYXJkT3V0cHV0PWpvdXJuYWwrY29uc29sZVxuU3RhbmRhcmRFcnJvcj1qb3VybmFsK2NvbnNvbGVcbkVudmlyb25tZW50RmlsZT0vZXRjL29jaS12YXVsdC9jb25maWdcbkV4ZWNTdGFydD0vb3B0L3NjcmlwdHMvZmV0Y2gtYm9vdHN0cmFwLXNlY3JldHMuc2hcblJlbWFpbkFmdGVyRXhpdD15ZXNcblxuW0luc3RhbGxdXG5XYW50ZWRCeT1tdWx0aS11c2VyLnRhcmdldFxuIiwiZW5hYmxlZCI6dHJ1ZSwibmFtZSI6ImZldGNoLWJvb3RzdHJhcC1zZWNyZXRzLnNlcnZpY2UifV19fQ=="
        } -> (known after apply) # forces replacement
      ~ private_ip                          = "172.16.0.28" -> (known after apply)
      + public_ip                           = (known after apply)
      ~ region                              = "uk-london-1" -> (known after apply)
      ~ security_attributes                 = {} -> (known after apply)
      ~ security_attributes_state           = "STABLE" -> (known after apply)
      ~ state                               = "RUNNING" -> (known after apply)
      ~ subnet_id                           = "ocid1.subnet.oc1.uk-london-1.aaaaaaaaocb6yhiygivj4tq5yfhsyyyefivkbtmd3vtiaws5mlhu5ni2bcvq" -> (known after apply)
      ~ system_tags                         = {} -> (known after apply)
      ~ time_created                        = "2026-02-01 23:06:54.369 +0000 UTC" -> (known after apply)
      + time_maintenance_reboot_due         = (known after apply)
        # (5 unchanged attributes hidden)

      ~ agent_config (known after apply)
      - agent_config {
          - are_all_plugins_disabled = false -> null
          - is_management_disabled   = false -> null
          - is_monitoring_disabled   = false -> null
        }

      ~ availability_config (known after apply)
      - availability_config {
          - is_live_migration_preferred = false -> null
          - recovery_action             = "RESTORE_INSTANCE" -> null
        }

      ~ create_vnic_details {
          ~ assign_ipv6ip             = false -> (known after apply)
          - assign_private_dns_record = false -> null
          ~ defined_tags              = {
              - "Oracle-Tags.CreatedBy" = "default/terraform"
              - "Oracle-Tags.CreatedOn" = "2026-02-01T23:06:53.804Z"
              - "terraform.managed"     = "terraform"
              - "terraform.name"        = "oci-apps"
              - "terraform.repo"        = "https://github.com/batinicaz/oci-apps"
            } -> (known after apply)
          ~ display_name              = "oci-apps" -> (known after apply)
          ~ freeform_tags             = {} -> (known after apply)
          + hostname_label            = (known after apply)
          ~ private_ip                = "172.16.0.28" -> (known after apply)
          ~ security_attributes       = {} -> (known after apply)
          ~ skip_source_dest_check    = false -> (known after apply)
          + subnet_cidr               = (known after apply)
          + vlan_id                   = (known after apply)
            # (3 unchanged attributes hidden)

          ~ ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      ~ launch_options {
          ~ boot_volume_type                    = "PARAVIRTUALIZED" -> (known after apply)
          ~ firmware                            = "UEFI_64" -> (known after apply)
          ~ is_consistent_volume_naming_enabled = true -> (known after apply)
          ~ remote_data_volume_type             = "PARAVIRTUALIZED" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ launch_volume_attachments (known after apply)

      ~ licensing_configs (known after apply)

      ~ placement_constraint_details (known after apply)

      ~ platform_config (known after apply)

      ~ preemptible_instance_config (known after apply)

      ~ shape_config {
          + baseline_ocpu_utilization     = (known after apply)
          + gpu_description               = (known after apply)
          ~ gpus                          = 0 -> (known after apply)
          + local_disk_description        = (known after apply)
          ~ local_disks                   = 0 -> (known after apply)
          ~ local_disks_total_size_in_gbs = 0 -> (known after apply)
          ~ max_vnic_attachments          = 2 -> (known after apply)
          ~ networking_bandwidth_in_gbps  = 1 -> (known after apply)
          ~ nvmes                         = 0 -> (known after apply)
          ~ processor_description         = "3.0 GHz Ampere® Altra™" -> (known after apply)
          + resource_management           = (known after apply)
          ~ vcpus                         = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ source_details {
          ~ boot_volume_vpus_per_gb         = "10" -> (known after apply)
          - is_preserve_boot_volume_enabled = false -> null
            # (4 unchanged attributes hidden)

          ~ instance_source_image_filter_details (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # oci_identity_dynamic_group.this will be updated in-place
  ~ resource "oci_identity_dynamic_group" "this" {
        id             = "ocid1.dynamicgroup.oc1..aaaaaaaaxep7ntfhuk7cuhcgnmyvgjag2fhhbxoefyveb4kdz2npzrsypusq"
      ~ matching_rule  = "instance.id = 'ocid1.instance.oc1.uk-london-1.anwgiljtwlhza7acjmxpk5llgfyzwybzwopnuixwsci2ifwg2lx4kcfpu25a'" -> (known after apply)
        name           = "oci-apps"
        # (6 unchanged attributes hidden)
    }

  # oci_load_balancer_backend.traefik must be replaced
-/+ resource "oci_load_balancer_backend" "traefik" {
      ~ drain            = false -> (known after apply)
      ~ id               = "loadBalancers/ocid1.loadbalancer.oc1.uk-london-1.aaaaaaaakgjfvnm67avsld5nuuabjxago6nwzr6ssogd5b65zgxdcwvx7xxa/backendSets/traefik/backends/172.16.0.28:80" -> (known after apply)
      ~ ip_address       = "172.16.0.28" -> (known after apply) # forces replacement
      + max_connections  = (known after apply)
      ~ name             = "172.16.0.28:80" -> (known after apply)
      ~ offline          = false -> (known after apply)
      ~ state            = "SUCCEEDED" -> (known after apply)
      ~ weight           = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/agent-config.yaml"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "1539" -> (known after apply)
      ~ content_md5                = "gvBq6p+5LGrhk1mrk0MGJw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Fagent-config.yaml" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/agent-config.yaml 2026-02-01 22:42:34.142095452 +0000 GMT" -> "./../os-config/infisical-config/agent-config.yaml 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "6453ffb5-0af6-4ca9-90fd-3a0776a4c76d" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/freshrss.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "138" -> (known after apply)
      ~ content_md5                = "2lVZJ2WbOYM+bd/69gdCWA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Ffreshrss.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/freshrss.env.tmpl 2026-02-01 22:42:34.142653373 +0000 GMT" -> "./../os-config/infisical-config/templates/freshrss.env.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "15d72450-4cbc-4e8e-9d2a-377d7f7ec3d7" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/fulltextrss-config.php.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "606" -> (known after apply)
      ~ content_md5                = "nJGwExTlLFCnNOCEuIoq9A==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Ffulltextrss-config.php.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/fulltextrss-config.php.tmpl 2026-02-01 22:42:36.457354948 +0000 GMT" -> "./../os-config/infisical-config/templates/fulltextrss-config.php.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "8eb3698b-e234-430a-8f1a-1cb1dfc2fd3d" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/ghcr-token.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "159" -> (known after apply)
      ~ content_md5                = "8dhlkgEsl0yAr60rjy+txA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fghcr-token.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/ghcr-token.tmpl 2026-02-01 22:42:34.143102125 +0000 GMT" -> "./../os-config/infisical-config/templates/ghcr-token.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "f292d02a-8572-4fd8-91dd-ab13f9cf635d" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter-config.conf.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "823" -> (known after apply)
      ~ content_md5                = "9Qdx22F1wRqMU4aBsI31iQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter-config.conf.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter-config.conf.tmpl 2026-02-01 22:42:34.143289252 +0000 GMT" -> "./../os-config/infisical-config/templates/nitter-config.conf.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "783bda5c-ba8a-4582-8fa0-1250e644619d" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter-sessions.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "134" -> (known after apply)
      ~ content_md5                = "mDL4ycY76BaAptRpg0tdWg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter-sessions.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter-sessions.tmpl 2026-02-01 22:42:34.143702171 +0000 GMT" -> "./../os-config/infisical-config/templates/nitter-sessions.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "d89997a8-be9f-4f43-9bdf-f9b463bc753a" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/nitter.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "dqew4r9hLjCgmZM0Ent8IA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fnitter.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/nitter.env.tmpl 2026-02-01 22:42:34.143929922 +0000 GMT" -> "./../os-config/infisical-config/templates/nitter.env.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "5d420fc9-3ccc-474d-930b-f88206a34333" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/planka-postgres.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "145" -> (known after apply)
      ~ content_md5                = "UuBhrWt6vw/DS8rRmijDpw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fplanka-postgres.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/planka-postgres.env.tmpl 2026-02-01 22:42:34.144137924 +0000 GMT" -> "./../os-config/infisical-config/templates/planka-postgres.env.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "e7a514c7-3292-45d0-8ef6-42c2fbe810cf" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/planka.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "UoV1pgPnJd9zAa/VSjVsug==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fplanka.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/planka.env.tmpl 2026-02-01 22:42:34.144345009 +0000 GMT" -> "./../os-config/infisical-config/templates/planka.env.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "58af471a-9af0-455d-8687-ff2fa65c9477" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/infisical-config/templates/redlib.env.tmpl"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "136" -> (known after apply)
      ~ content_md5                = "BQch5XB0PknGP/8l2GKw8w==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Finfisical-config%2Ftemplates%2Fredlib.env.tmpl" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/infisical-config/templates/redlib.env.tmpl 2026-02-01 22:42:34.144544135 +0000 GMT" -> "./../os-config/infisical-config/templates/redlib.env.tmpl 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "0418c33e-924f-436e-85fa-2012d8e6b585" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/autorestic-backup.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "824" -> (known after apply)
      ~ content_md5                = "HRhu6dPvDUR11JG6/QxYoQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Fautorestic-backup.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/autorestic-backup.container 2026-02-01 22:42:34.144959971 +0000 GMT" -> "./../os-config/quadlets/autorestic-backup.container 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "7687cea6-c2cf-4fd4-931a-6438f64a37f2" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/autorestic-restore.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "1011" -> (known after apply)
      ~ content_md5                = "cUmYQjuvmQOayUovSxxU1Q==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Fautorestic-restore.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/autorestic-restore.container 2026-02-01 22:42:34.145172597 +0000 GMT" -> "./../os-config/quadlets/autorestic-restore.container 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "206e846a-e794-4112-8a61-218de30fbfd3" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/infisical-agent.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "643" -> (known after apply)
      ~ content_md5                = "rbNV/YwXJEJ98Ah6innH3g==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Finfisical-agent.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/infisical-agent.container 2026-02-01 22:42:34.145500349 +0000 GMT" -> "./../os-config/quadlets/infisical-agent.container 2026-02-01 23:45:17.164498235 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "80743745-299e-4604-b1d6-339e28ce5a00" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/quadlets/traefik.container"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "441" -> (known after apply)
      ~ content_md5                = "liTv9S0p/ZpRNFG6/hDddQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fquadlets%2Ftraefik.container" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/quadlets/traefik.container 2026-02-01 22:42:34.145704476 +0000 GMT" -> "./../os-config/quadlets/traefik.container 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "27b8b198-1ea7-4982-9927-d5c3b11ed635" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-backup-wrapper.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "493" -> (known after apply)
      ~ content_md5                = "zs/BL6xGQX7UB8jI5tH9Zw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-backup-wrapper.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-backup-wrapper.service 2026-02-01 22:42:34.147422487 +0000 GMT" -> "./../os-config/systemd/app-backup-wrapper.service 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "039575be-0b59-4694-a365-1d93a6084e4e" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-backup.timer"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "179" -> (known after apply)
      ~ content_md5                = "fGvbbPWuCkC5I2HxzpD7cg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-backup.timer" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-backup.timer 2026-02-01 22:42:34.147584863 +0000 GMT" -> "./../os-config/systemd/app-backup.timer 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "e472ecee-1f7e-48a3-a254-c7138e57668e" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/app-restart@.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "119" -> (known after apply)
      ~ content_md5                = "gsf5zYqlcPhQM1f3s6ImNg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fapp-restart@.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/app-restart@.service 2026-02-01 22:42:34.147859448 +0000 GMT" -> "./../os-config/systemd/app-restart@.service 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "efbc10ff-8997-437a-a56e-65bc13043c09" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/freshrss.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "203" -> (known after apply)
      ~ content_md5                = "sQrUNOXfCCwmi+Y3p0VN0A==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Ffreshrss.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/freshrss.path 2026-02-01 22:42:34.149139789 +0000 GMT" -> "./../os-config/systemd/freshrss.path 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "3343d6df-f6f9-43eb-be70-a6bafd5c59eb" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/freshrss.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "429" -> (known after apply)
      ~ content_md5                = "tDR+CI8b+bx6BAF6k7OSiw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Ffreshrss.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/freshrss.service 2026-02-01 22:42:34.14941375 +0000 GMT" -> "./../os-config/systemd/freshrss.service 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "df811b1d-16ea-418d-9bb5-efe2cff15c4a" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/ghcr-login.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "333" -> (known after apply)
      ~ content_md5                = "3DoYQr7BhzU3ZJzbrUnNEw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fghcr-login.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/ghcr-login.service 2026-02-01 22:42:34.149573334 +0000 GMT" -> "./../os-config/systemd/ghcr-login.service 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "906df0f9-c115-427d-8ae6-63470f086fa9" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/gitops-sync.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "193" -> (known after apply)
      ~ content_md5                = "rjkWfNVqAvnTLiaWl7hnJA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fgitops-sync.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/gitops-sync.service 2026-02-01 22:42:34.149728668 +0000 GMT" -> "./../os-config/systemd/gitops-sync.service 2026-02-01 23:45:17.165498225 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "9f60337d-2a2b-4a82-b6ab-aa0d5630979f" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/gitops-sync.timer"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "116" -> (known after apply)
      ~ content_md5                = "AM0Wi3K0wtCLJHuxwySDRQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fgitops-sync.timer" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/gitops-sync.timer 2026-02-01 22:42:34.150000587 +0000 GMT" -> "./../os-config/systemd/gitops-sync.timer 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "a0a38585-3717-4f0d-a8b0-f9888a0d2c71" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/nitter.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "243" -> (known after apply)
      ~ content_md5                = "lscA8O+eZvgiXR3gP/Btgg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fnitter.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/nitter.path 2026-02-01 22:42:34.150285755 +0000 GMT" -> "./../os-config/systemd/nitter.path 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "56e93e7c-3d7e-4a12-aba4-aa3a4c47fc1c" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/nitter.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "402" -> (known after apply)
      ~ content_md5                = "+7KApK1BrAqJvpX/B/XZiw==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fnitter.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/nitter.service 2026-02-01 22:42:34.150567674 +0000 GMT" -> "./../os-config/systemd/nitter.service 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "f093f00e-d4ff-48a1-baad-6427ae514bf2" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/planka.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "241" -> (known after apply)
      ~ content_md5                = "UbkGbkBS2oYM6GajhXBxMQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fplanka.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/planka.path 2026-02-01 22:42:34.150800967 +0000 GMT" -> "./../os-config/systemd/planka.path 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "9f1a473a-f1a2-44b4-a311-b589f9aa4724" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/planka.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "427" -> (known after apply)
      ~ content_md5                = "f5bqzVFjkIjH9a61v7cSTg==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fplanka.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/planka.service 2026-02-01 22:42:34.150958426 +0000 GMT" -> "./../os-config/systemd/planka.service 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "834618f6-01de-49cc-bcca-dd544c424841" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/redlib.path"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "195" -> (known after apply)
      ~ content_md5                = "3GUaxW21h3nYYUCgZAsQJA==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fredlib.path" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/redlib.path 2026-02-01 22:42:34.151274928 +0000 GMT" -> "./../os-config/systemd/redlib.path 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "e1c6fd92-794f-457b-8806-75ab16b1d1f3" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/systemd/redlib.service"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "347" -> (known after apply)
      ~ content_md5                = "uFZzmQd+5jUQ7RUTIUeXUQ==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Fsystemd%2Fredlib.service" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/systemd/redlib.service 2026-02-01 22:42:34.15147593 +0000 GMT" -> "./../os-config/systemd/redlib.service 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "f4836a99-840f-401a-85dc-5fc4f734c032" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # oci_objectstorage_object.bootstrap_config["config/traefik-config/traefik.yml"] must be replaced
-/+ resource "oci_objectstorage_object" "bootstrap_config" {
      ~ content_length             = "236" -> (known after apply)
      ~ content_md5                = "CD3FZoMyQ+KlqQKelCO21Q==" -> (known after apply)
      ~ id                         = "n/lrky0f1nmots/b/oci-apps/o/config%2Ftraefik-config%2Ftraefik.yml" -> (known after apply)
      - metadata                   = {} -> null
      + opc_sse_kms_key_id         = (known after apply)
      ~ source                     = "./../os-config/traefik-config/traefik.yml 2026-02-01 22:42:34.152330935 +0000 GMT" -> "./../os-config/traefik-config/traefik.yml 2026-02-01 23:45:17.166498215 +0000 UTC" # forces replacement
      ~ state                      = "COMPLETED" -> (known after apply)
      ~ storage_tier               = "Standard" -> (known after apply)
      ~ version_id                 = "3e9c4ef6-e4d0-452d-92c6-f859f9898188" -> (known after apply)
      + work_request_id            = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # tailscale_tailnet_key.this will be replaced due to changes in replace_triggered_by
-/+ resource "tailscale_tailnet_key" "this" {
      ~ created_at    = "2026-02-01T23:06:53Z" -> (known after apply)
      ~ expires_at    = "2026-02-01T23:12:53Z" -> (known after apply)
      ~ expiry        = 360 -> 600 # forces replacement
      ~ id            = "kvQ34tQkwP11CNTRL" -> (known after apply)
      ~ invalid       = true -> (known after apply)
      ~ key           = (sensitive value)
        tags          = [
            "tag:oci",
        ]
      + user_id       = (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 33 to add, 1 to change, 33 to destroy.

```